app/Models/EmployeeEstimatedTimeModel.php

SELECT *
FROM `employee_estimated_times`
WHERE `employee_id` = '13'
---
  public function getAllEmployeeTimeAdds()
  {
    return $this->where('created_by !=', 'admin')->findAll();

SELECT *
FROM `employee_estimated_times`
WHERE `project_id` = '22'
---
  public function getProjectEmployeeTimeAdds($project_id)
  {
    return $this->where('project_id', $project_id)->findAll();