app/Models/MessageModel.php

SELECT *
FROM `messages`
WHERE `request_id` = '25'
---
  public function getMessagesOfRequest($request_id)
  {
    return $this->where('request_id', $request_id)->findAll();

INSERT INTO `messages` (`text`, `attach`, `request_id`, `created_date`, `created_by`) VALUES ('dsfsdf', NULL, '4', '2022-08-25 16:50:20', 'employee 1')
---
  public function createMessage($message_data)
  {
    $message = [
      'text' => $message_data['text'],
      'attach' => $message_data['attach'],
      'request_id' => $message_data['request_id'],
      'created_date' => Time::parse('now', 'Europe/Bucharest'),
      'created_by' => $message_data['created_by']
    ];

    $this->insert($message);