app/Models/ProjectEmployeeModel.php

SELECT `employee_id`
FROM `project_employees`
WHERE `project_id` = '28'
---
  public function getEmployeesOfProject($project_id)
  {
    return $this->select('employee_id')->where('project_id', $project_id)->findAll();

INSERT INTO `project_employees` (`created_date`, `employee_id`, `project_id`) VALUES ('Wednesday 17th of August 2022 07:36:43 AM','5','15')
---
  public function setEmployeeOfProject($project_id, $employee_ids)
  {
    $project_employees = [];
    foreach ($employee_ids as $employee_id) {
      array_push($project_employees, [
        'project_id' => $project_id,
        'employee_id' => $employee_id,
        'created_date' => date('l jS \of F Y h:i:s A')
      ]);
    }

    $this->insertBatch($project_employees);

DELETE FROM `project_employees`
WHERE `project_id` = '4'
---
  public function deleteAllOfProject($project_id)
  {
    $this->where('project_id', $project_id)->delete();