app/Models/ProjectModel.php

SELECT `id`, `title`, `description`, `status`, `customer_id`, `estimated_time`
FROM `projects`
WHERE `customer_id` = '12'
 LIMIT 1
---
  public function getProjectByCustomer($customer_id)
  {
    return $this->select('id, title, description, status, customer_id, estimated_time')->where('customer_id', $customer_id)->first();

SELECT `id`
FROM `projects`
WHERE `title` = 'aaa'
 LIMIT 1
---
  public function getProjectByTitle($title)
  {
    return $this->select('id')->where('title', $title)->first();

SELECT `id`, `title`, `description`, `status`, `customer_id`, `estimated_time`
FROM `projects`
WHERE `id` = '4'
 LIMIT 1
---
  public function getProjectById($id)
  {
    return $this->select('id, title, description, status, customer_id, estimated_time')->where('id', $id)->first();

UPDATE `projects` SET `title` = '123', `description` = '123123', `customer_id` = '12', `status` = 1
WHERE `projects`.`id` IN ('4')
---
  public function edit($project_id, $project_data)
  {
    $this->update($project_id, $project_data);

INSERT INTO `projects` (`title`, `description`, `customer_id`, `created_by`, `status`, `created_date`) VALUES ('aaa', 'uuuuu', '2', 'd', 0, 'Wednesday 17th of August 2022 07:36:43 AM')
---
  public function create($project_data)
  {
    $project = $project_data;
    $project['status'] = 0; // In Progress
    $project['estimated_time'] = 0;
    $project['created_date'] = Time::parse('now', 'Europe/Bucharest');

    $this->insert($project);