app/Models/ProjectModel.php

SELECT *
FROM `projects`
WHERE `status` != 9
AND `status` != 2
---
  public function getAllProjects()
  {
    return $this->where('status !=', 9)->where('status !=', 2)->findAll();

SELECT *
FROM `projects`
WHERE `status` != 2
---
  public function getArchivedProjects()
  {
    return $this->where('status', 2)->findAll();