app/Models/ProjectModel.php

  public function getAllProjects()
  {
    return $this->select('id, title, description, status')->findAll();
---
SELECT `title`, `description`
FROM `projects`