app/Models/RequestModel.php

UPDATE `requests` SET `status` = 1
WHERE `requests`.`id` IN ('29')
---
  public function approveRequest($id)
  {
    $this->update($id, ['status' => 1]);

UPDATE `requests` SET `status` = 0
WHERE `requests`.`id` IN ('7')
---
  public function cancelRequest($id)
  {
    $this->update($id, ['status' => 0]);

SELECT *
FROM `requests`
WHERE `id` = '7'
 LIMIT 1
---
  public function getRequestById($id)
  {
    return $this->where('id', $id)->first();

SELECT *
FROM `requests`
WHERE `project_id` = '1'
---
  public function getRequestsOfProject($project_id)
  {
    return $this->where('project_id', $project_id)->findAll();