app/Models/RequestModel.php

  public function getRequestById($id)
  {
    return $this->where('id', $id)->first();
---
SELECT *
FROM `requests`
WHERE `id` = '25'
 LIMIT 1

  public function getRequestsOfProject($project_id)
  {
    return $this->where('project_id', $project_id)->findAll();
---
SELECT *
FROM `requests`
WHERE `project_id` = '42'

  public function createRequest($request_data)
  {
    $request = [
      'title' => $request_data['title'],
      'description' => $request_data['description'],
      'status' => $request_data['status'],
      'project_id' => $request_data['project_id'],
      'created_date' => Time::parse('now', 'Europe/Bucharest'),
      'created_by' => $request_data['created_by']
    ];

    $this->insert($request);
---
INSERT INTO `requests` (`title`, `description`, `status`, `project_id`, `created_date`, `created_by`) VALUES ('request!!', 'this is request', 0, '42', '2022-08-22 11:39:35', '12')