app/Models/RequestModel.php

SELECT *
FROM `requests`
WHERE `project_id` = '35'
---
  public function getRequestsOfProject($project_id)
  {
    return $this->where('project_id', $project_id)->findAll();