app/Models/UserModel.php

SELECT `id`, `name`
FROM `users`
WHERE `id` = ('13')
 LIMIT 1
---
  public function getUsersByIds($user_ids)
  {
    $users = [];
    foreach ($user_ids as $user_id) {
      $user = $this->select('id, name')->where('id', $user_id)->first();

SELECT `id`, `name`
FROM `users`
WHERE `role` = 0
---
  public function getAllCustomers()
  {
    return $this->select('id, name')->where('role', 0)->findAll();

SELECT `id`, `name`
FROM `users`
WHERE `role` = 1
---
  public function getAllEmployees()
  {
    return $this->select('id, name')->where('role', 1)->findAll();

SELECT `id`, `name`
FROM `users`
WHERE `id` = '12'
 LIMIT 1
---
  public function getUserById($id)
  {
    return $this->select('id, name')->where('id', $id)->first();

SELECT *
FROM `users`
WHERE `email` = 'd@gmail.com'
 LIMIT 1
---
  public function findUserByEmail($user_email)
  {
    $db_user = $this->where('email', $user_email)->first();

SELECT *
FROM `users`
WHERE `email` = 'd@gmail.com'
 LIMIT 1
---
  public function login($user_data)
  {
    // Find user in db
    $user = $this->where('email', $user_data['email'])->first();